0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    rocket
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    
    walls
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    
    #includeEtc "caseDicts/setConstraintTypes"

}

// ************************************************************************* //
